app/controllers/geofences_controller.rb

INSERT INTO "geofences" ("name", "lat", "lon", "radius", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "we"], ["lat", 3.0], ["lon", 4.0], ["radius", 8.0], ["created_at", "2018-08-20 16:38:36.921615"], ["updated_at", "2018-08-20 16:38:36.921615"], ["user_id", 1]]
---
  def create
    @geofence = Geofence.new(geofence_params)
    @geofence.user_id = current_user.id  # Preenchendo o campo com o id do usuário logado
    respond_to do |format|
      if @geofence.save

SELECT  "geofences".* FROM "geofences" WHERE "geofences"."user_id" = ? AND "geofences"."id" = ? LIMIT ?  [["user_id", 1], ["id", 2], ["LIMIT", 1]]
---
    def set_geofence
      begin
        @geofence = current_user.geofences.find(params[:id])